In [66]:
import numpy as np
import pandas as pd

In [67]:
data = np.random.randn(4,3)
data

array([[ 1.0232303 ,  0.56876884,  0.39285812],
       [-1.15814532, -0.37293269,  0.7721177 ],
       [-2.51365693,  0.28661646,  0.51059391],
       [-0.4963429 , -0.13887002,  0.466875  ]])

In [68]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0  1.023230  0.568769  0.392858
1 -1.158145 -0.372933  0.772118
2 -2.513657  0.286616  0.510594
3 -0.496343 -0.138870  0.466875

In [69]:
dataFrame2 = pd.DataFrame(data,index=["Burak","Mehmet","Ahmet","Atil"],columns=["Maas","Yas","Calisma Saati"])
dataFrame2

            Maas       Yas  Calisma Saati
Burak   1.023230  0.568769       0.392858
Mehmet -1.158145 -0.372933       0.772118
Ahmet  -2.513657  0.286616       0.510594
Atil   -0.496343 -0.138870       0.466875

In [70]:
dataFrame2["Yas"]

Burak     0.568769
Mehmet   -0.372933
Ahmet     0.286616
Atil     -0.138870
Name: Yas, dtype: float64

In [71]:
dataFrame2[["Maas" , "Yas"]]

            Maas       Yas
Burak   1.023230  0.568769
Mehmet -1.158145 -0.372933
Ahmet  -2.513657  0.286616
Atil   -0.496343 -0.138870

In [72]:
dataFrame2.loc["Burak"]
dataFrame2.iloc[0]

Maas             1.023230
Yas              0.568769
Calisma Saati    0.392858
Name: Burak, dtype: float64

## Yeni sutun ekleme

In [73]:
dataFrame2["Emeklilik"]=dataFrame2["Yas"] + dataFrame2["Yas"]
dataFrame2

            Maas       Yas  Calisma Saati  Emeklilik
Burak   1.023230  0.568769       0.392858   1.137538
Mehmet -1.158145 -0.372933       0.772118  -0.745865
Ahmet  -2.513657  0.286616       0.510594   0.573233
Atil   -0.496343 -0.138870       0.466875  -0.277740

## Sutun Silme

In [74]:
dataFrame2.drop("Emeklilik" , axis=1)

            Maas       Yas  Calisma Saati
Burak   1.023230  0.568769       0.392858
Mehmet -1.158145 -0.372933       0.772118
Ahmet  -2.513657  0.286616       0.510594
Atil   -0.496343 -0.138870       0.466875

## Satir Silme

In [75]:
dataFrame2.drop("Atil" , axis=0)

            Maas       Yas  Calisma Saati  Emeklilik
Burak   1.023230  0.568769       0.392858   1.137538
Mehmet -1.158145 -0.372933       0.772118  -0.745865
Ahmet  -2.513657  0.286616       0.510594   0.573233

In [76]:
dataFrame2

            Maas       Yas  Calisma Saati  Emeklilik
Burak   1.023230  0.568769       0.392858   1.137538
Mehmet -1.158145 -0.372933       0.772118  -0.745865
Ahmet  -2.513657  0.286616       0.510594   0.573233
Atil   -0.496343 -0.138870       0.466875  -0.277740

## Tablodan Tamamen Silmek

In [77]:
dataFrame2.drop("Atil" , axis=0,inplace=True)

In [78]:
dataFrame2

            Maas       Yas  Calisma Saati  Emeklilik
Burak   1.023230  0.568769       0.392858   1.137538
Mehmet -1.158145 -0.372933       0.772118  -0.745865
Ahmet  -2.513657  0.286616       0.510594   0.573233

## Veriye Erişmek

In [79]:
dataFrame2.loc["Burak","Yas"]=5

## Eleme Yapma

In [80]:
dataFrame2[dataFrame2["Yas"] > 0] # yaşı 0 dan büyük olanlar

           Maas       Yas  Calisma Saati  Emeklilik
Burak  1.023230  5.000000       0.392858   1.137538
Ahmet -2.513657  0.286616       0.510594   0.573233

## Index Değiştirme

In [81]:
dataFrame2.reset_index()

    index      Maas       Yas  Calisma Saati  Emeklilik
0   Burak  1.023230  5.000000       0.392858   1.137538
1  Mehmet -1.158145 -0.372933       0.772118  -0.745865
2   Ahmet -2.513657  0.286616       0.510594   0.573233

In [82]:
yeniIndex=["Ati","Ebo","Blok"]
dataFrame2["Yeni Index"]=yeniIndex
dataFrame2

            Maas       Yas  Calisma Saati  Emeklilik Yeni Index
Burak   1.023230  5.000000       0.392858   1.137538        Ati
Mehmet -1.158145 -0.372933       0.772118  -0.745865        Ebo
Ahmet  -2.513657  0.286616       0.510594   0.573233       Blok

In [83]:
dataFrame2.set_index("Yeni Index",inplace=True)
dataFrame2

                Maas       Yas  Calisma Saati  Emeklilik
Yeni Index
Ati         1.023230  5.000000       0.392858   1.137538
Ebo        -1.158145 -0.372933       0.772118  -0.745865
Blok       -2.513657  0.286616       0.510594   0.573233